import numpy as np

# 👇下面是一个复杂的dtype，其中包含了多个字段，每个字段都有自己的类型和形状
dt = np.dtype([('Name', 'S10'), ('Age', 'i4'),('Height', 'f'), ('Children/Pet', 'i4', 2)])
# 👆这段代码的意思是，定义了一个结构数组，其中包含四个字段，
# 分别是Name、Age、Height和Children/Pet，
# 每个字段的类型分别是字符串、整数、浮点数和整数数组。

# dtype的作用是定义结构数组的格式
# print(dt)

# dt = np.dtype({'names': ['Name', 'Age', 'Height', 'Children/Pet'],
#                'formats': ['S10', 'i4', 'f', 'i4', 2]})
# 👆这段代码的意思是，定义了一个结构数组，其中包含四个字段，

# print(dt)

s = np.array([('Smith', 45, 1.83, (0, 1)), ('Jones', 53, 1.72, (2, 2))], dtype=dt)

# print(s)

print(type(s))
# type(s)是numpy.ndarray类型，表示s是一个结构数组

print(s['Name'])
# s['Name']是s数组中所有行的Name字段的值，返回一个一维数组
print(s['Height'])
# s['Height']是s数组中所有行的Height字段的值，返回一个一维数组
print(s[0])
# s[0]是s数组中第一行的所有字段的值，返回一个元组
print(s[1]['Age'])
# s[1]['Age']是s数组中第二行的Age字段的值，返回一个整数