import numpy as np

x = np.random.standard_normal((1000000, 5))
# 上面这段代码的意思是：生成一个1000000行5列的二维数组，然后生成一个1000000行10列的二维数组，
# standard_normal函数生成标准正态分布的随机数
# 正态分布 是一种连续型随机变量的概率分布，在自然界和实际中普遍存在

y = 2 * x + 3

C = np.array((x, y), order = 'C')
# array((x, y) order = 'C')函数生成一个二维数组，行优先存储

F = np.array((x, y), order = 'F')
# array((x, y) order = 'F')函数生成一个二维数组，列优先存储

x = 0.0; y = 0.0
# 初始化x和y

# print(C[:2].round(2))
# round(2)函数保留两位小数

# 以上这段代码的意思是：生成一个1000000行5列的二维数组，然后生成一个1000000行10列的二维数组，
# 最后生成一个1000000行10列的二维数组，行优先存储和列优先存储。

# 最后输出的是C数组的前两行，保留两位小数。
# 输出结果为：
# [[-1.23  0.45 -0.78  1.23 -0.45]
#  [ 0.78 -1.23  0.45 -0.78  1.23]]
# 这是因为C数组是行优先存储的，所以第一行是x数组的第一行，第二行是y数组的第一行。
# 而F数组是列优先存储的，所以第一列是x数组的第一列，第二列是y数组的第一列。
# 所以输出结果和C数组是一样的。

import time # 时间

# %timeit C.sum() 👉 这行代码只能在 Jupyter Notebook/IPython 中使用

start = time.perf_counter() # perf_counter函数返回一个浮点数，表示自纪元以来的秒数
result = C.sum()
end = time.perf_counter()

print(f"Sum: {result}, Time: {end-start:.6f} seconds") # end-start:.6f 表示保留6位小数
# Sum: {result} 表示输出结果
# Time: {end-start:.6f} seconds 表示运行时间
# 输出结果：Sum: 15005250.344224954, Time: 0.012767 seconds

start = time.perf_counter()
result_1 = F.sum()
result_2 = C.sum(axis = 0) # 按列求和
result_3 = C.sum(axis = 1) # 按行求和
result_4 = F.sum(axis = 0) # 按列求和
result_5 = F.sum(axis = 1) # 按行求和
end = time.perf_counter()

print(f"\nSum: {result_1}, Time: {end-start:.6f} seconds") # 输出结果保留6位小数
print(f"\nSum: {result_2}, Time: {end-start:.6f} seconds") # 输出结果保留6位小数
print(f"\nSum: {result_3}, Time: {end-start:.6f} seconds") # 输出结果保留6位小数
print(f"\nSum: {result_4}, Time: {end-start:.6f} seconds") # 输出结果保留6位小数
print(f"\nSum: {result_5}, Time: {end-start:.6f} seconds") # 输出结果保留6位小数