import numpy as np
import pandas as pd

np.random.seed(100) # 设置随机种子，保证每次运行结果一致
# seed：随机数生成器的种子，可以是任意整数，默认为None，即随机种子
a = np.random.standard_normal((9, 4)) # 生成9行4列的随机数
# standard_normal：生成服从标准正态分布的随机数
# 标准正态分布的意思是均值为0，标准差为1的正态分布
# 均值是随机数的期望值，计算方式是所有随机数的平均值
# 标准差是随机数的波动范围，计算方式是所有随机数的平方和的平均值的平方根

# print(a)

df = pd.DataFrame(a) # 将数组a转换为DataFrame对象
# DataFrame：二维的表格型数据结构，可以看作是Series的容器
print(df)

# 我们可以随时定义/更改DataFrame对象的属性：
print("\n")

df.columns = ['No1', 'No2', 'No3', 'No4'] # 定义列名

print(df)
print("\n")

print(df['No2'].mean()) # 计算No2列的平均值
print("\n")


# 👇创建一个 DatetimeIndex 对象
dates = pd.date_range('2019-1-1',
                      periods=9,
                      freq='M')
# 生成9个日期，从2019-1-1开始，间隔为1个月

print(dates)
print("\n")

# 下列代码将刚刚创建的 DatetimeIndex 对象作为行索引

df.index = dates # 定义行索引
print(df)
print("\n")

print(df.values) # 获取DataFrame对象的值
print("\n")

print(np.array(df)) # 将DataFrame对象转换为数组
print("\n")


# 【5.2 基本分析】

print(df.info()) # 显示DataFrame的摘要信息，包括索引、列、数据类型和内存使用情况。
print("\n")

print(df.describe()) # 显示DataFrame的统计摘要，包括计数、平均值、标准差、最小值、四分位数和最大值。
print("\n")

# 求和：

print(df.sum()) # 求和
print("\n")

# 求平均值：

print(df.mean()) # 求平均值
print("\n")

# 求标准差：
print(df.std()) # 求标准差
print("\n")

print(df.mean(axis=0)) # 求每列的平均值
print("\n")

print(df.mean(axis=1)) # 求每行的平均值
print("\n")

print(df.cumsum()) # 求累积和


# DataFrame对象也能理解为NumPy通用函数：
print("\n")

print(np.mean(df)) # 求平均值
print("\n")

print(np.log(df)) # 求对数
print("\n")

print(np.sqrt(abs(df))) # 求绝对值后再开平方
print("\n")

print(np.sqrt(abs(df)).sum()) # 求绝对值后再开平方，然后求和
print("\n")

print(100 * df + 100) # 每个元素都加上100