# 21. reversed() 函数, 用于反向迭代序列

numbers = [1, 2, 3, 4, 5]
reversed_numbers = list(reversed(numbers))
print(reversed_numbers)  # 输出 [5, 4, 3, 2, 1]
print()
# reversed() 函数返回一个反向迭代器，而不是一个新的列表。 ‼️因此，我们需要使用 list() 函数将其转换为列表。

# ‼️ 迭代器：一个可以记住遍历的位置的对象。
# ‼️ 可迭代对象：一个可以返回一个迭代器的对象，如列表、元组、字典、集合、字符串等。

# 迭代器对象从集合的第一个元素开始访问，直到所有的元素被访问完结束。
# 迭代器只能往前不会后退。
# 迭代器有两个基本的方法：iter() 和 next()。
# 字符串、列表或元组对象都可用于创建迭代器：
# 🧀️ iter() 函数创建迭代器
# 🧀️ next() 函数获取迭代器中的下一个项目
# 迭代器对象可以使用 next() 函数获取下一个元素。
# 当没有元素可以返回时，next() 函数会抛出一个 StopIteration 异常。
# —————————————————————— #

# 迭代器用法的例子：
# 创建一个迭代器
it = iter([1, 2, 3]) # 🧀️ iter() 函数创建迭代器。

print(it) # 输出 <list_iterator object at 0x000001>
print()


print(type(it))  # 输出 <class 'list_iterator'>
print()

# 使用 🧀️ next() 函数获取下一个元素
print(next(it))  # 输出 1
print(next(it))  # 输出 2
print(next(it))  # 输出 3
print()

# 当没有元素可以返回时，next() 函数会抛出一个 StopIteration 异常


# 22.zip() 函数, 用于将可迭代对象（如列表、元组、字符串等）拆分为多个元素组成的元组

names = ['Alice', 'Bob', 'Charlie']
ages = [25, 30, 35]
zipped = list(zip(names, ages))
print(zipped)  # 输出 [('Alice', 25), ('Bob', 30), ('Charlie', 35)]
print()
# zip() 函数返回一个迭代器，可以使用 list() 函数将其转换为列表。
# 如果可迭代对象的长度不一致，zip() 函数会以最短的可迭代对象为基准，截断较长的可迭代对象。
# 例如，如果 names 列表有 3 个元素，ages 列表有 2 个元素，那么 zip() 函数只会返回 2 个元组。
# —————————————————————— #


# 23.enumerate()：返回一个枚举对象，用于遍历可迭代对象，enumerate意思是枚举
names = ['Alice', 'Bob', 'Charlie']
print(enumerate(names))  # 输出 <enumerate object at 0x000001>
print(list(enumerate(names)))  # 输出 [(0, 'Alice'), (1, 'Bob'), (2, 'Charlie')]
print()

for index, name in enumerate(names):
    print(f"Name at index {index}: {name}")
print()


# 24.any()：判断可迭代对象中是否存在至少一个元素为真，如果存在则返回 True，否则返回 False
numbers = [0, 1, 2, 3, 4]
print(any(numbers))  # 输出 True
print()


# 25.all()：判断可迭代对象中是否所有元素都为真，如果所有元素都为真则返回 True，否则返回 False
numbers = [0, 1, 2, 3, 4]
print(all(numbers))  # 输出 False
print()
