'''
number = input('请输入3个整数，中间以空格分隔，按回车键结束输入：')

print('输入的3个整数分别是：', number) 
        # ‼️ 注意：input的内容的类型是【字符串】

number = [int(item) for item in number.split(' ')]
        # 将字符串转换为整数  # num.split(' ')：将字符串按照空格分隔，返回一个列表

print('将字符串转换为整数后的3个整数分别是：', number)

print('将字符串转换为整数后的3个整数的类型是：', type(number))   # <class 'list'>意思是：num的类型是列表

print('转换后的3个整数的和是：', sum(number))
print('转换后的3个整数的平均值是：', sum(number)/len(number))
print('转换后的3个整数的最大值是：', max(number))
print('转换后的3个整数的最小值是：', min(number))
'''

# 4. range()函数,用于生成一个整数序列，可以指定序列的起始值、终止值和步长

print(type(range(10)))  # <class 'range'>

for i in range(10):
    print(i, end=' ') # end=' '：表示不换行输出, 默认是换行输出
print()

for i in range(5, 10): # range(5, 10)：表示生成从5到9的整数序列, 不包括10, 即左闭右开区间, 步长默认为1
    print(i, end=' ')
print()

for i in range(5, 10, 2): # range(5, 10, 2)：表示生成从5到9的整数序列, 步长为2
    print(i, end=' ')
print()

for i in range(10, 0, -1): # range(10, 0, -1)：表示生成从10到1的整数序列, 步长为-1, 也就是从大到小。
    print(i, end=' ')
print()

print(list(range(10))) # 将range对象转换为列表

# 6. sorted()函数,用于对可迭代对象进行排序,返回一个新的列表

print(sorted([1, 3, 2, 5, 4])) # [1, 2, 3, 4, 5]
print()

print(sorted([1, 3, 2, 5, 4], reverse=True)) # [5, 4, 3, 2, 1], ‼️reverse=True：表示降序排序
print()

a = [[6, 5], [3, 7], [2, 8]]
print(sorted(a, key=lambda x: x[0])) # 按照列表中每个元素的第一个元素进行排序
print()

print(sorted(a, key=lambda x: x[1])) # 按照列表中每个元素的第二个元素进行排序
print()

# 💡💡💡 lambda：匿名函数，用于定义一个简单的函数，不需要使用def关键字 ————《Pythonn高手修炼之道》P33
        # 可以接受任意数量的参数，‼️ 但只能有一个表达式，表达式的值就是函数的返回值。
        
# key=lambda x: x[0]：表示按照列表中每个元素的第一个元素进行排序
# key=lambda x: x[1]：表示按照列表中每个元素的第二个元素进行排序
# key=lambda x: x['name']：表示按照字典中每个元素的'name'键对应的值进行排序
# key=lambda 的意思是：按照列表中每个元素的第一个元素进行排序


b = [{'name': 'C', 'age': 18},
     {'name': 'A', 'age': 20},
     {'name': 'B', 'age': 19}]
print(sorted(b, key=lambda x: x['name'])) # 按照字典中每个元素的'name'键对应的值进行排序
print()

print(sorted(b, key=lambda x: x['age'])) # 按照字典中每个元素的'age'键对应的值进行排序
print()

# 8. isinstance()函数,用于判断一个对象是否是一个类的实例

a = [3, 4, 5]
b = ('x', 'y')
c = dict()
d = 'hello'
print(isinstance(a, list)) # True
print(isinstance(b, tuple)) # True
print(isinstance(c, dict)) # True
print(isinstance(d, str)) # True
print()

print(isinstance(d, list)) # False
print(isinstance(d, tuple)) # False
print(isinstance(d, dict)) # False
print()
